<template>
	<view class="Loan-Datali-remaining">
		<view class="remaining-Title">
			<view class="Title">
				还款方式: <span>协议还款</span>
			</view>
			<view class="SubText">
				单位: 人民币元 
			</view>
		</view>
		<view class="remaining-ListView" v-for="(item,index) in !IsTrue ? remainingListOne : remainingList" :key="index">
			<view class="num">
				{{index+1}}
			</view>
			<view class="date">
				{{item.date}}
			</view>
			<view class="Money">
				<p>{{item.Money[0]}}</p>
				<span>{{item.Money[1]}}</span>
			</view>
		</view>
		<footVue></footVue>
	</view>
</template>

<script>
	import footVue from './foot.vue';
	export default {
		name:"remaining",
		data() {
			return {
				remainingListOne:[
					{date:'2025/06/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2025/07/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2025/08/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2025/09/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2025/10/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2025/11/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2025/12/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2026/01/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/02/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/03/11',Money:['应还款528,89','本金0.00|利息528,89']},
					{date:'2026/04/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/05/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2026/06/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/07/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2026/08/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/09/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/10/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2026/11/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2026/12/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2027/01/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2027/02/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2027/03/11',Money:['应还款528,89','本金0.00|利息528,89']},
					{date:'2027/04/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2027/05/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2027/06/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2027/07/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2027/08/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2027/09/11',Money:['应还款585.56','本金0.00|利息585.56']},
					{date:'2027/10/11',Money:['应还款566.67','本金0.00|利息566.67']},
					{date:'2027/11/08',Money:['应还款200,528.89','本金0.00|利息528.89']},
				],
				
				remainingList:[
					{date:'2025/07/01',Money:['应还款6,517.59','本金4,000.00|利息2,517.59']},
					{date:'2025/08/01',Money:['应还款6,517.08','本金4,000.00|利息2,517.08']},
					{date:'2025/09/01',Money:['应还款6,516.56','本金4,000.00|利息2,516.56']},
					{date:'2025/10/01',Money:['应还款6,516.04','本金4,000.00|利息2,516.04']},
					{date:'2025/11/01',Money:['应还款6,515.48','本金4,000.00|利息2,515.48']},
					{date:'2025/12/01',Money:['应还款6,514.93','本金4,000.00|利息2,514.93']},
					{date:'2026/01/01',Money:['应还款6,514.40','本金4,000.00|利息2,514.40']},
					{date:'2026/02/01',Money:['应还款6,513.78','本金4,000.00|利息2,513.78']},
					{date:'2026/03/01',Money:['应还款6,513.20','本金4,000.00|利息2,513.20']},
					{date:'2026/04/01',Money:['应还款6,512.51','本金4,000.00|利息2,512.51']},
					{date:'2026/05/01',Money:['应还款6,511,94','本金4,000.00|利息2,511,94']},
					{date:'2026/06/01',Money:['应还款6,511,29','本金4,000.00|利息2,511,29']},
					{date:'2026/07/01',Money:['应还款6,510,51','本金4,000.00|利息2,510,51']},
					{date:'2026/08/01',Money:['应还款6,509,96','本金4,000.00|利息2,509,96']},
					{date:'2026/09/01',Money:['应还款6,509,42','本金4,000.00|利息2,509,42']},
					{date:'2026/10/01',Money:['应还款6,508,77','本金4,000.00|利息2,508,77']},
					{date:'2026/11/01',Money:['应还款6,508,16','本金4,000.00|利息2,508,16']},
					{date:'2026/12/01',Money:['应还款6,507,62','本金4,000.00|利息2,507,62']},
					{date:'2027/01/01',Money:['应还款6,507,07','本金4,000.00|利息2,507,07']},
					{date:'2027/02/01',Money:['应还款6,506,41','本金4,000.00|利息2,506,41']},
					{date:'2027/03/01',Money:['应还款6,505,85','本金4,000.00|利息2,505,85']},
					{date:'2027/04/01',Money:['应还款6,503,55','本金4,000.00|利息2,503,55']},
					{date:'2027/05/01',Money:['应还款6,501,61','本金4,000.00|利息2,501,61']},
					{date:'2027/06/01',Money:['应还款6,499,28','本金4,000.00|利息2,499,28']},
					{date:'2027/07/01',Money:['应还款6,497,54','本金4,000.00|利息2,497,54']},
					{date:'2027/08/01',Money:['应还款6,493,14','本金4,000.00|利息2,493,14']},
					{date:'2027/09/01',Money:['应还款6,491,35','本金4,000.00|利息2,491,35']},
					{date:'2027/10/01',Money:['应还款6,488,99','本金4,000.00|利息2,488,99']},
					{date:'2027/11/01',Money:['应还款2,486,58','本金0.00|利息2,486,58']},
					{date:'2027/11/05',Money:['应还款760,000.00','本金760,000.00|利息0.00']},
					{date:'2027/11/08',Money:['应还款672.13','本金0.00|利息672.13']},
				]
			};
		},
		components:{
			footVue
		},
		props:{
			IsTrue:{
				type:Boolean,
			}
		}
	}
</script>

<style lang="scss">
	.Loan-Datali-remaining{
		width: 100%;
		background-color: #fff;
		.remaining-Title{
			font-size: 28rpx;
			.Title{
				width: 100%;
				background-color: #f5f9fe;
				padding: 20rpx;
				span{
					font-weight: bold;
					margin-left: 10rpx;
				}
			}
			.SubText{
				background-color: #f4f4f4;
				padding: 10rpx 20rpx;
				text-align: right;
			}
		}
		.remaining-ListView{
			display: flex;
			align-items: center;
			justify-content: space-between;
			padding: 20rpx;
			border-bottom: 1px solid #ddd;
			.num{
				width: 50rpx;
				height: 50rpx;
				font-size: 25rpx;
				background-color: #f4f4f4;
				border-radius: 50rpx;
				display: flex;
				align-items: center;
				justify-content: center;
			}
			.date{
				font-weight: bold;
				font-size: 28rpx;
			}
			.Money{
				width: 55%;
				text-align: right;
				p{
					font-size: 30rpx;
					font-weight: bold;
				}
				span{
					font-size: 25rpx;
				}
			}
		}
	}
</style>